apple-open-source/macos/IOUSBFamily/AppleUSBOHCI/Classes/AppleUSBOHCI_RootHub.cpp
    value |= kOHCIHcRhPortStatus_PSSC; /* clear suspend status change */

    _pOHCIRegisters->hcRhPortStatus[port] = HostToUSBLong(value);
    IOSync();

    return;
}

void AppleUSBOHCI::OHCIRootHubResetEnableChange(UInt16 port)
{
    UInt32		value = 0;

    value |= kOHCIHcRhPortStatus_PESC; /* clear enable status change */

    _pOHCIRegisters->hcRhPortStatus[port] = HostToUSBLong(value);
    IOSync();

    return;
}

    

void AppleUSBOHCI::OHCIRootHubResetOverCurrentChange(UInt16 port)
{
    UInt32		value = 0;

    value |= kOHCIHcRhPortStatus_OCIC; /* clear over current status change */

    _pOHCIRegisters->hcRhPortStatus[port] = HostToUSBLong(value);
    IOSync();

    return;
}


void AppleUSBOHCI::OHCIRootHubResetPort (UInt16 port)
{
    UInt32		value = 0;

    value |= kOHCIHcRhPortStatus_PRS; /* sets Bit 8 in port root hub register */
    _pOHCIRegisters->hcRhPortStatus[port] = HostToUSBLong(value);
    IOSync();
    return;

}

void AppleUSBOHCI::OHCIRootHubPortEnable(UInt16	port,
                                      bool	on)
{
    UInt32		value = 0;

    if(on)
        value |= kOHCIHcRhPortStatus_PES; /* enable port */
    else
        value |= kOHCIHcRhPortStatus_CCS; /* disable port */

    _pOHCIRegisters->hcRhPortStatus[port] = HostToUSBLong(value);
    IOSync();

    return;
}

void AppleUSBOHCI::OHCIRootHubPortSuspend(UInt16	port,
                                       bool	on)
{
    UInt32		value = 0;

    if(on)
        value |= kOHCIHcRhPortStatus_PSS;  /* suspend port */
    else
        value |= kOHCIHcRhPortStatus_POCI; /* resume port */

    _pOHCIRegisters->hcRhPortStatus[port] = HostToUSBLong(value);
    IOSync();

    return;
}

void AppleUSBOHCI::OHCIRootHubPortPower(UInt16	port,
                                     bool	on)
{
    UInt32		value = 0;

    USBLog(5,"%s: OHCIRootHubPortPower for port %d",getName(),port);
    
    if(on)
        value |= kOHCIHcRhPortStatus_PPS;  /* enable port power */
    else
        value |= kOHCIHcRhPortStatus_LSDA; /* disable port power */

    _pOHCIRegisters->hcRhPortStatus[port] = HostToUSBLong(value);
    IOSync();

    return;
}

/*
 * UIMRootHubStatusChange
 *
 * This method gets called when there is a change in the root hub status
 * or a change in the status of one of the ports.  It is assumed that the
 * interrupt will be cleared for us, but we don't clear the change
 * condition, we will get another interrupt.  So turn off the interrupt.
 * Entering this function means that someone turned on the RHSC interrupt
 * and that there is a client waiting in the queue.  The client expects a
 * status change bitmap.
 * To fix: currently there can only be one client in the queue.  The RHSC
 * interrupt should only be turned off if there is no one else in the queue,
 * or, all clients should be responded to with the one interrupt.
 */
void AppleUSBOHCI::UIMRootHubStatusChange(void)
{
    UIMRootHubStatusChange(false);
}

OSMetaClassDefineReservedUsed(IOUSBController,  10);
void 
AppleUSBOHCI::UIMRootHubStatusChange(bool abort)
{
    UInt32 		hubStatus, portStatus, statusBit;
    UInt16 		statusChangedBitmap;   /* only have 15 ports in OHCI */
    UInt8		numPorts = 0;
    unsigned int      	index, port, move;
    struct InterruptTransaction last;
    UInt32		descriptorA;

    /* turn off RHSC interrupt */
    _pOHCIRegisters->hcInterruptDisable = HostToUSBLong(kOHCIHcInterrupt_RHSC);
    IOSync();

    /*
     * Encode the status change bitmap.  The format of the bitmap:
     * bit0 = hub status changed
     * bit1 = port 1 status changed
     * bit2 = port 2 status changed
     * ...
     * See USB 1.0 spec section 11.8.3 for more info.
     */

    statusChangedBitmap = 0;
    statusBit = 1;

	if (!abort && GetRootHubStatus((IOUSBHubStatus *)&hubStatus) == kIOReturnSuccess)
	{
	    if ((hubStatus & kOHCIHcRhStatus_Change ) != 0)
	    {
	        statusChangedBitmap |= statusBit; /* Hub status change bit */
		}
		
		// Find the numPorts for this root hub
		//
	    descriptorA = USBToHostLong(_pOHCIRegisters->hcRhDescriptorA);
	    numPorts = ((descriptorA & kOHCIHcRhDescriptorA_NDP)
	                >> kOHCIHcRhDescriptorA_NDPPhase);

	    for (port = 1; port <= numPorts; port++)
	    {
	        statusBit <<= 1;    /* Next bit */

	        GetRootHubPortStatus((IOUSBHubPortStatus *)&portStatus, port);
	       	if ((portStatus & kOHCIHcRhPortStatus_Change) != 0)
	            statusChangedBitmap |= statusBit; /* Hub status change bit */
	    }
	}
	
    /*
     * If a transaction is queued, handle it
     */
    if ( (abort || (statusChangedBitmap != 0)) && (_outstandingTrans[0].completion.action != NULL) )
    {
        last = _outstandingTrans[0];
        IOTakeLock(_intLock);
        for (index = 1; index < kMaxOutstandingTrans ; index++)
        {
            _outstandingTrans[index-1] = _outstandingTrans[index];
            if (_outstandingTrans[index].completion.action == NULL)
            {
                break;
      		}
        }

        // Update the time stamp for a root hub status change
        //
        clock_get_uptime( &_lastRootHubStatusChanged );
        
        move = last.bufLen;
        if (move > sizeof(statusChangedBitmap))
            move = sizeof(statusChangedBitmap);
        if (numPorts < 8)
            move = 1;

        statusChangedBitmap = HostToUSBWord(statusChangedBitmap);
        last.buf->writeBytes(0,&statusChangedBitmap, move);
        IOUnlock(_intLock); /* Unlock the queue */
        Complete(last.completion, (abort ? kIOReturnAborted : kIOReturnSuccess), last.bufLen - move);
    }
}

/*
 * SimulateRootHubInt
 * Simulate the interrupt pipe (status change pipe) of a hub for the root
 * hub.  The basic concept is to simulate the UIMCreateInterruptTransfer
 * so we keep our own little queue -> _outstandingTrans.  We are turning
 * on the RHSC interrupt so UIMRootHubStatusChange() should handle the
 * dequeueing.
 */
void AppleUSBOHCI::SimulateRootHubInt(
            UInt8					endpoint,
            IOMemoryDescriptor *			buf,
            UInt32 					bufLen,
            IOUSBCompletion				completion)
{
    int 		index;

    if (endpoint != 1)
    {
        Complete(completion, -1, bufLen);
        return;
    }

